//начало текста модуля

#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьОбработка(Парам01)","УМеняЕстьОбработка","Допустим у меня есть обработка ""../lib/ВычислениеВозраста.epf""");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьДатаРождения(Парам01)","УМеняЕстьДатаРождения","Допустим у меня есть дата рождения 30.07.1982");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"Сегодня(Парам01)","Сегодня","и сегодня 19.08.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РезультатВычесленияРавен(Парам01)","РезультатВычесленияРавен","Тогда результат вычесления равен 409");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим у меня есть дата рождения 30.07.1982
//@УМеняЕстьДатаРождения(Парам01)
Процедура УМеняЕстьДатаРождения(Парам01) Экспорт
	Контекст.Вставить("ДатаРожденеия",Парам01);
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	//ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//и сегодня 19.08.2016
//@Сегодня(Парам01)
Процедура Сегодня(Парам01) Экспорт
		Контекст.Вставить("ДатаСегодня",Парам01);

	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	//ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда результат вычесления равен 408
//@РезультатВычесленияРавен(Парам01)
Процедура РезультатВычесленияРавен(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	//ВызватьИсключение "Не реализовано.";
	Сообщить(Контекст.ПутьКобработке);
	КоличествоМесяцев = ПолучитьКоличествоМесяцевНаСервере(Контекст.ПутьКобработке,Контекст.ДатаРожденеия,Контекст.ДатаСегодня);
	Если КоличествоМесяцев <> Парам01 Тогда
		ВызватьИсключение "Неверный расчет месяцев";
	КонецЕсли;	
	
КонецПроцедуры


//окончание текста модуля

&НаКлиенте
//Допустим у меня есть обработка "../lib/ВычислениеВозраста.epf"
//@УМеняЕстьОбработка(Парам01)
Процедура УМеняЕстьОбработка(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	НайденныеФайлы = НайтиФайлы(Парам01);
	Если НайденныеФайлы.Количество() = 0 Тогда
		ВызватьИсключение "Обработка не найдена";
	КонецЕсли;
	Контекст.Вставить("ПутьКобработке",Парам01);	
	//ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоМесяцевНаСервере(ПутьКОбработке,ДатаРожденя,ДатаСегодня = неопределено)
	Сообщить(ПутьКОбработке);
	Обработка = ВнешниеОбработки.Создать(ПутьКОбработке); 
	КоличествоМесяцев = Обработка.ВычислитьВозрастВМесяцах(ДатаРожденя,ДатаСегодня);
	
	Возврат КоличествоМесяцев;	
КонецФункции	
